Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>Установка цен на номенклатуру</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрировытьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры/Forms/ФормаЗаполненияИзДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	Элементы.УчитыватьСтоимостьДоставки.Видимость = (ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг"));
	//ДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДокументПриИзмененииНаСервере()
	
	//ТаблицаРезультата.Очистить();
	////Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг")
	//// ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
	//Для каждого Товар Из Документ.Товары Цикл
	//	НовыйТовар = ТаблицаРезультата.Добавить();
	//	НовыйТовар.Номенклатура = Товар.Номенклатура;
	//	НовыйТовар.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
	//	НовыйТовар.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
	//	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
	//		НовыйТовар.Цена = Товар.Цена;	
	//	КонецЕсли;
	//КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьТоварыИзДокумента(Команда)
	СформироватьТаблицуРезультатаНаСервере();
	// закрыть в форму с передачей результата
	Закрыть(ТаблицаРезультата);
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуРезультатаНаСервере()
	
	ТаблицаРезультата.Очистить();
	
	Для каждого Товар Из Документ.Товары Цикл
		НовыйТовар = ТаблицаРезультата.Добавить();
		НовыйТовар.Номенклатура = Товар.Номенклатура;
		НовыйТовар.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		НовыйТовар.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
			Если НЕ ВключатьСтоимостьДоставки Тогда
				НовыйТовар.Цена = Товар.Цена;
			Иначе
				Коэффициент = 0;
				Если НЕ Документ.Товары.Итог("Сумма") = 0 Тогда
					Коэффициент = Товар.Сумма / Документ.Товары.Итог("Сумма");
				КонецЕсли;
				НовыйТовар.Цена = Товар.Цена + Окр(Документ.СтоимостьДоставки * Коэффициент / Товар.Количество, 2); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 	
	
КонецПроцедуры
